In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [37]:
ser1 = pd.Series(["ali",'hamad',"ahmed"],index=[1,2,3])
ser1

1      ali
2    hamad
3    ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [38]:
ser1.index= [11,12,13]
ser1

11      ali
12    hamad
13    ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [39]:
ser1[:2]

11      ali
12    hamad
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [40]:
ser2 = pd.Series(["ali"])
ser1 = ser1.append(ser2)
print(ser1)
ser1.drop_duplicates(inplace=True)
print(ser1)

11      ali
12    hamad
13    ahmed
0       ali
dtype: object
11      ali
12    hamad
13    ahmed
dtype: object

C:\Users\aonf7\AppData\Local\Temp\ipykernel_9456\2179890440.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1 = ser1.append(ser2)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [41]:
Student = pd.DataFrame({"ID":[],"Name":[],"GPA":[]})
Student

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [42]:
file = pd.read_csv("educ_figdp_1_Data.csv")
file.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [47]:
file.loc[0]

TIME                                                               2000
GEO                                       European Union (28 countries)
INDIC_ED              Total public expenditure on education as % of ...
Value                                                                 :
Flag and Footnotes                                                  NaN
Name: 0, dtype: object

In [48]:
file[:20]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e